Repository: common-repository/woohistory
Catalog: languages/woohistory-*.po
Languages: el

source: WooHistory Settings
el: Ρυθμίσεις WooHistory

source: Search by Phone
el: Αναζήτηση με Αριθμό Τηλεφώνου

source: Search by Email
el: Αναζήτηση με email

source: Search by Name
el: Αναζήτηση με όνομα

source: History
el: Ιστορικό

source: Total Orders
el: Σύνολο Παραγγελιών

source: View Order
el: Παραγγελία

source: Other Customer Orders
el: Άλλες Παραγγελίες

source: Receipt Denied
el: Άρνηση Παραλαβής

source: Receipt Denied <span class="count">(%s)</span>
el: Άρνηση Παραλαβής <span class="count">(%s)</span>

source: Receipt Ignored
el: Αδιαφορία Παραλαβής

source: Receipt Ignored <span class="count">(%s)</span>
el: Αδιαφορία Παραλαβής <span class="count">(%s)</span>
